<?php

return [

    'warning' => 'Предупреждение',
    'carting' => 'Товар успешно сохранен в корзину!',
    'uncarting' => 'Товар успешно удален!',
    'itmdstr' => 'Товар успешно удален!',
    'itmupd' => 'Товар успешно изменен!',
    'itmstr' => 'Ваш товар успешно добавлен',
    'cmmstr' => 'Ваше комментария успешно добавлено!',
    'cmmupd' => 'Ваше мнение было успешно изменено!',
    'cmmdstr' => 'Ваш комментарий успешно удален!',
    'buy' => 'Ваш заказ был успешно принят!',
    'cancel' => 'Отмена',
    'deletecart' => 'Вы уверены, что продолжите?',
    'nobalance' => 'Недостаточно средств на счете!',
    'month' => 'месяц',
    'year' => 'год',
    'myorders' => 'Мои Заказы',
    'balance' => 'Ваш баланс успешно пополнен!'

];
